{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "217e26ca-0db9-45e3-9c46-9ee0c7f8cb38",
   "metadata": {},
   "source": [
    "# Quering the SOSA graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "ffe4db96",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# imports\n",
    "\n",
    "import json\n",
    "import time\n",
    "import pandas as pd\n",
    "\n",
    "from rdflib import Graph\n",
    "import uuid\n",
    "from rdflib import Namespace\n",
    "from rdflib import FOAF, DCTERMS, SKOS, VANN, TIME, RDF, RDFS, XSD, OWL, Literal"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "a6c2601f",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N5d08a4cb54d842d2b712a17504202dd3 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g = Graph()\n",
    "## g.parse('/home/brieuc/Documents/dev/abromics/abromics-kg/dev/analysis/sosa-graph.ttl', format='ttl')\n",
    "g.parse('/home/brieuc/Documents/dev/abromics/abromics-kg/dev/analysis/out/sosa.ttl', format='ttl')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ecb82078",
   "metadata": {},
   "source": [
    "## Quering the sosa graph\n",
    "\n",
    "Check the journal to see all the queries to test on the SOSA graph\n",
    "\n",
    "- Get all the resistance genes for a sample\n",
    "- Rank the resistance genes found for a sample by the coverage percentage\n",
    "- Get all the antibiotic, a specific strain is resistance to\n",
    "- Get all the samples where a specific strain is present (filtering by mlst and by specie name)\n",
    "- Get uniprot id of an antitbiotic and as well as it's molecular formula and a link to it's 3d structure\n",
    "- Get the most spread resistance genes present in a certain geospacial area"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "1b09f2bf-71ae-4c41-90e6-3f4a92de5c71",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0000 - 69\n",
      "0001 - 48\n",
      "0002 - 768\n",
      "0003 - 10\n",
      "0004 - 12\n",
      "0005 - 38\n",
      "0006 - 648\n",
      "0008 - 10\n",
      "0009 - 58\n"
     ]
    }
   ],
   "source": [
    "## Filter samples by ST of the strains contained in them \n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "\n",
    "    SELECT ?sampleId ?st \n",
    "    WHERE {\n",
    "        ?samples a sosa:FeatureOfInterest ;\n",
    "             rdf:type sio:001050 ;\n",
    "             schema:identifier ?sampleId .\n",
    "             \n",
    "        ?observations sosa:hasFeatureOfInterest ?samples ;\n",
    "             sosa:hasFeatureOfInterest ?strains .\n",
    "        \n",
    "        ?strains a aro:Strain ;\n",
    "            abromics:has_st ?st . \n",
    "    }\n",
    "    GROUP BY ?sampleId\n",
    "\"\"\" \n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.sampleId} - {row.st}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "672af503",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "blaTEM-1A\n",
      "tet(A)\n",
      "sul1\n",
      "qacE\n",
      "dfrA1\n",
      "aadA1\n"
     ]
    }
   ],
   "source": [
    "## Q1 of hackmd\n",
    "## Get all the resistance gen for a sample 1\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "\n",
    "    SELECT DISTINCT ?resGeneNames\n",
    "    WHERE {\n",
    "        ?sample a sosa:FeatureOfInterest .\n",
    "        ?sample rdf:type sio:001050 ;\n",
    "            schema:identifier \"0000\" .\n",
    "        \n",
    "        ?resGenesProperty a sosa:ObservableProperty .\n",
    "        ?resGenesProperty rdfs:label \"Resistance gene\"^^xsd:string .\n",
    "        \n",
    "        ?observations sosa:hasObservableProperty ?resGenesProperty .\n",
    "        ?observations sosa:hasFeatureOfInterest ?sample .\n",
    "        ?observations sosa:hasResult ?results .\n",
    "        ?results sosa:hasSimpleResult ?resGeneNames .\n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.resGeneNames}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "723508ce-a68f-415a-8fc9-3c38763cb693",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "tet(A) - tet(A)\n",
      "sul1 - sul1\n",
      "qacE - qacE\n",
      "dfrA1 - dfrA1\n",
      "blaTEM-1A - blaTEM-1A\n",
      "aadA1 - aadA1\n"
     ]
    }
   ],
   "source": [
    "## Get all the resistance genes for a sample (with id = 0001) and rank them with their according to their coverage\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    \n",
    "    SELECT DISTINCT ?geneNames ?geneCoverage \n",
    "    WHERE {\n",
    "        ?sample a sosa:FeatureOfInterest ;\n",
    "            schema:identifier \"0000\" .\n",
    "        \n",
    "        ?resGenesProperty a sosa:ObservableProperty ;\n",
    "            rdfs:label \"Resistance gene\"^^xsd:string .\n",
    "            \n",
    "        ?observations sosa:hasObservableProperty ?resGenesProperty ;\n",
    "            sosa:hasFeatureOfInterest ?genes ;\n",
    "            sosa:hasFeatureOfInterest ?sample ;\n",
    "            sosa:hasResult ?results .\n",
    "            \n",
    "        ?genes a sosa:FeatureOfInterest ;\n",
    "            a go:Gene ;\n",
    "            rdfs:label ?geneNames .\n",
    "            \n",
    "        ?results sosa:hasSimpleResult ?geneCoverage .\n",
    "    }\n",
    "    ORDER BY DESC(?geneCoverage)\n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.geneNames} - {row.geneCoverage}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8d1c2343-035c-4b0c-91d0-d3b1b0be8c6d",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "erm(B) - 100.13 - 0002\n",
      "mph(A) - 100.11 - 0003\n",
      "mph(A) - 100.11 - 0004\n",
      "dfrA1 - 100.0 - 0000\n",
      "dfrA1 - 100.0 - 0006\n",
      "mcr-9 - 100.0 - 0004\n",
      "fexA - 100.0 - 0002\n",
      "catB3 - 100.0 - 0004\n",
      "tet(L) - 100.0 - 0002\n",
      "dfrG - 100.0 - 0002\n"
     ]
    }
   ],
   "source": [
    "# Q2 of hackmd (all samples)\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    PREFIX sio: <http://semanticscience.org/resource/>\n",
    "\n",
    "    SELECT DISTINCT ?gene_name ?coverage ?s_id WHERE {\n",
    "    \n",
    "        ?sample schema:identifier ?s_id ;\n",
    "            a sio:001050 .\n",
    "        \n",
    "        ?coverage_prop a sosa:ObservableProperty ;\n",
    "                rdfs:label \"Coverage %\"^^xsd:string .\n",
    "                \n",
    "        ?observations sosa:hasObservableProperty ?coverage_prop ;\n",
    "            sosa:hasFeatureOfInterest ?sample ;\n",
    "            sosa:hasResult/sosa:hasSimpleResult ?coverage .\n",
    "        \n",
    "        ?genes a sosa:FeatureOfInterest ;\n",
    "            a go:Gene .\n",
    "            \n",
    "        ?observations sosa:hasFeatureOfInterest ?genes .\n",
    "        ?genes rdfs:label ?gene_name .\n",
    "    } \n",
    "    ORDER BY DESC(?coverage) \n",
    "    LIMIT 10 # Top-10 most covered\n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.gene_name} - {row.coverage} - {row.s_id}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "f951c1dd-7e65-4f18-a451-cc1266a61e9e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "erm(B) - 100.13 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "mph(A) - 100.11 - 0003 - 35.8648067 - -120.6195831 - 12.75\n",
      "mph(A) - 100.11 - 0004 - 35.8648067 - -120.6195831 - 12.75\n",
      "blaTEM-1A - 100.0 - 0000 - 35.8648067 - -120.6195831 - 12.75\n",
      "dfrA1 - 100.0 - 0000 - 35.8648067 - -120.6195831 - 12.75\n",
      "sitABCD - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "blaOXA-1 - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "catA1 - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "dfrA36 - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "tet(B) - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "aph(3')-Ia - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "sul1 - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "sul2 - 100.0 - 0001 - 35.8648067 - -120.6195831 - 12.75\n",
      "ant(6)-Ia - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "optrA - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "dfrG - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "lsa(A) - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "tet(L) - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "aph(3')-III - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n",
      "tet(M) - 100.0 - 0002 - 35.8648067 - -120.6195831 - 12.75\n"
     ]
    }
   ],
   "source": [
    "## Q3: List the TOP-K antibiotic resistance genes by coverage in a geographical region of interest ##! Takes quite some time to execute\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "\n",
    "    SELECT DISTINCT ?gene_name ?coverage ?s_id ?lat ?long ?alt \n",
    "    WHERE {\n",
    "    \n",
    "        ?location a sosa:FeatureOfInterest ;\n",
    "            geo:lat \"35.8648067\"^^xsd:decimal ;\n",
    "            geo:long \"-120.6195831\"^^xsd:decimal ;\n",
    "            geo:alt \"12.75\"^^xsd:decimal .\n",
    "    \n",
    "        ?location geo:lat ?lat ;\n",
    "            geo:long ?long ;\n",
    "            geo:alt ?alt .\n",
    "    \n",
    "        ?sample schema:identifier ?s_id ;\n",
    "            a sio:001050 .\n",
    "        \n",
    "        ?coverage_prop a sosa:ObservableProperty ;\n",
    "                rdfs:label \"Coverage %\"^^xsd:string .\n",
    "                \n",
    "        ?observations sosa:hasObservableProperty ?coverage_prop ;\n",
    "            sosa:hasFeatureOfInterest ?sample ;\n",
    "            sosa:hasFeatureOfInterest ?location ;\n",
    "            sosa:hasResult/sosa:hasSimpleResult ?coverage .\n",
    "        \n",
    "        ?genes a sosa:FeatureOfInterest ;\n",
    "            a go:Gene .\n",
    "            \n",
    "        ?observations sosa:hasFeatureOfInterest ?genes .\n",
    "        ?genes rdfs:label ?gene_name .\n",
    "    }\n",
    "    ORDER BY DESC(?coverage) \n",
    "    LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.gene_name} - {row.coverage} - {row.s_id} - {row.lat} - {row.long} - {row.alt}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "1e3841ef-5df0-4a9e-ac83-94dd1945449b",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "erm(B) - 100.13\n",
      "dfrA1 - 100.0\n",
      "blaTEM-1A - 100.0\n",
      "sul1 - 100.0\n",
      "sitABCD - 100.0\n",
      "tet(B) - 100.0\n",
      "blaOXA-1 - 100.0\n",
      "catA1 - 100.0\n",
      "dfrA36 - 100.0\n",
      "aph(3')-Ia - 100.0\n",
      "sul2 - 100.0\n",
      "optrA - 100.0\n",
      "tet(M) - 100.0\n",
      "fexA - 100.0\n",
      "ant(6)-Ia - 100.0\n",
      "dfrG - 100.0\n",
      "lsa(A) - 100.0\n",
      "tet(L) - 100.0\n",
      "aph(3')-III - 100.0\n",
      "blaCTX-M-55 - 100.0\n"
     ]
    }
   ],
   "source": [
    "## Q3bis: List the TOP-K antibiotic resistance genes for a specific country\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "\n",
    "    SELECT DISTINCT ?gene_name ?coverage\n",
    "    WHERE {\n",
    "    \n",
    "        ?sample schema:identifier ?s_id ;\n",
    "            a sio:001050 ;\n",
    "            abromics:country \"Belgium\" .\n",
    "        \n",
    "        ?coverage_prop a sosa:ObservableProperty ;\n",
    "                rdfs:label \"Coverage %\"^^xsd:string .\n",
    "                \n",
    "        ?observations sosa:hasObservableProperty ?coverage_prop ;\n",
    "            sosa:hasFeatureOfInterest ?sample ;\n",
    "            sosa:hasFeatureOfInterest ?location ;\n",
    "            sosa:hasResult/sosa:hasSimpleResult ?coverage .\n",
    "        \n",
    "        ?genes a sosa:FeatureOfInterest ;\n",
    "            a go:Gene .\n",
    "            \n",
    "        ?observations sosa:hasFeatureOfInterest ?genes .\n",
    "        ?genes rdfs:label ?gene_name .\n",
    "    }\n",
    "    ORDER BY DESC(?coverage) \n",
    "    LIMIT 20 \n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.gene_name} - {row.coverage}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "52c0f5c2-85cb-4d76-af90-572bf3e117bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sul2\n",
      "sitABCD\n",
      "tet(B)\n",
      "blaCTX-M-15\n",
      "dfrA17\n",
      "aadA5\n",
      "qacE\n",
      "sul1\n",
      "mph(A)\n",
      "aac(3)-IIa\n",
      "blaOXA-1\n",
      "catB3\n",
      "aac(6')-Ib-cr\n",
      "aac(6')-Ib-cr\n",
      "blaTEM-35\n",
      "blaCTX-M-27\n",
      "aph(3'')-Ib\n",
      "aph(6)-Id\n",
      "tet(B)\n"
     ]
    }
   ],
   "source": [
    "## Q4: Common antibiotic resistance genes between two time points, for all available samples\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    \n",
    "    SELECT ?resGeneName\n",
    "    WHERE {\n",
    "\n",
    "        ?resGenesProperty a sosa:ObservableProperty .\n",
    "        ?resGenesProperty rdfs:label \"Resistance gene\"^^xsd:string .\n",
    "        ?observations sosa:hasObservableProperty ?resGenesProperty .\n",
    "        \n",
    "        ?observations sosa:hasResult/sosa:resultTime ?resTime .\n",
    "        FILTER(?resTime > \"2018-06-05T12:00:00Z\"^^xsd:dateTime && ?resTime < \"2019-07-01T12:00:00Z\"^^xsd:dateTime).\n",
    "        \n",
    "        ?observations sosa:hasResult ?results .\n",
    "        ?results sosa:hasSimpleResult ?resGeneName .\n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.resGeneName}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "f29abf4f-f245-46eb-8450-097d64dc5d50",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "## Q6: Get all the antibiotics a specific specie (defined by its ncbi taxonomic id) is resistant to\n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "\n",
    "    SELECT DISTINCT ?antibiotics \n",
    "    WHERE {\n",
    "        ?strain a aro:Strain ;\n",
    "            a sosa:FeatureOfInterest .\n",
    "        ?strain obo:RO_0002162 <http://purl.uniprot.org/taxonomy/562> . # Get the E.Coli taxon from ncbi\n",
    "        ## doesn't work anymore -> this property should be given to a gene not a strain ?strain aro:confers_resistance_to_antibiotic ?antibiotics\n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.antibiotics}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "62c3a5db-e0b7-4b7c-90ab-45f9b96b328f",
   "metadata": {},
   "outputs": [],
   "source": [
    "## Q7: Find all the strain with the same antibiotic resistance gene found\n",
    "\n",
    "## change \"sul1\" to \"sul2\" to showcase that the filtering process is working as the strain 1\n",
    "## contains \"sul1\" but not \"sul2\" \n",
    "\n",
    "query = \"\"\"\n",
    "    PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
    "    PREFIX schema: <https://schema.org/>\n",
    "    PREFIX abromics: <https://abromics.fr/>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "    PREFIX obo: <http://purl.obolibrary.org/obo/>\n",
    "    PREFIX aro: <http://purl.obolibrary.org/obo/aro.owl#>\n",
    "    PREFIX go: <http://purl.org/obo/owl/GO#>\n",
    "    PREFIX uniprot: <http://purl.uniprot.org/uniprot/>\n",
    "    PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "    \n",
    "    SELECT ?strains ?latitude ?longitude ?altitude\n",
    "    WHERE {\n",
    "        ?strains a aro:Strain .\n",
    "            \n",
    "        ?gene rdfs:label \"sul1\" .\n",
    "        ?geneObservableProperty a sosa:ObservableProperty ;\n",
    "            rdfs:label \"Antibiotic resistant gene names\"^^xsd:string .\n",
    "        ?observations sosa:hasFeatureOfInterest ?gene ;\n",
    "            sosa:hasObservableProperty ?geneObservableProperty ;\n",
    "            sosa:hasFeatureOfInterest ?strains ;\n",
    "            sosa:hasFeatureOfInterest ?location .\n",
    "        ?location geo:lat ?latitude ;\n",
    "            geo:long ?longitude ;\n",
    "            geo:alt ?altitude .\n",
    "    }\n",
    "\"\"\"\n",
    "\n",
    "res = g.query(query)\n",
    "\n",
    "for row in res:\n",
    "    print(f\"{row.strains} - {row.latitude} - {row.longitude} - {row.altitude}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "69250a35-dfcd-46b7-844d-cdbc59be1a27",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
